src/clojars-worklog/2021/index.org
#+TITLE: Clojars Worklog - 2021
#+AUTHOR: Toby Crawley
#+EMAIL: toby@tcrawley.org
#+OPTIONS:   num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../worklog-style.css" />

* Intro
  :PROPERTIES:
  :CUSTOM_ID: intro
  :END:

This worklog covers work performed on [[https://clojars.org][Clojars]] under a contract from
the [[https://www.clojuriststogether.org/][Clojurists Together Foundation]]. The contract covers security
improvements and general maintenance.

* January 2021
  :PROPERTIES:
  :CUSTOM_ID: jan-2021
  :END:

*Changelogs:* [[https://github.com/clojars/clojars-server-config/compare/18c2ee360e93e25c804a9ef0fa458e07c3022b70...8b53cbf011f906dfb62a60ea75ff21468a3396fe][~clojars-server-config~]]

This work this month was general maintenance, along with debugging
issues with maven index creation.

* February 2021
  :PROPERTIES:
  :CUSTOM_ID: feb-2021
  :END:

*Changelogs:* [[https://github.com/clojars/clojars-web/compare/de99524...956175e][~clojars-web~]]

The bulk of work this month was [[https://github.com/clojars/clojars-web/wiki/Verified-Group-Names][developing a plan]] to improve security
by requiring groups to be verified and [[https://github.com/clojars/clojars-web/projects/1][starting work]] on that plan.

* March 2021
  :PROPERTIES:
  :CUSTOM_ID: mar-2021
  :END:

*Changelogs:* [[https://github.com/clojars/clojars-web/compare/956175...1885988ea69dd69193c13387ed413902760a2ca8][~clojars-web~]], [[https://github.com/clojars/clojars-server-config/compare/8b53cbf011f906dfb62a60ea75ff21468a3396fe...0d6fe9b4594c291fdfc2e0413b730d43cbd2ccc3][~clojars-server-config~]]

The work this month moved us closer to [[https://github.com/clojars/clojars-web/projects/1][verified groups]], which included:
- [[https://github.com/clojars/clojars-web/issues/784][auto-verifying GitHub-based groups]]
- [[https://github.com/clojars/clojars-web/issues/786][login with GitLab]]
- [[https://github.com/clojars/clojars-web/issues/787][auto-verifying GitLab-based groups]]
