src/clojars-worklog/2021/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-10 Sat 11:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Clojars Worklog - 2021</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Toby Crawley" />
<link rel="stylesheet" type="text/css" href="../worklog-style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Clojars Worklog - 2021</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#intro">Intro</a></li>
<li><a href="#jan-2021">January 2021</a></li>
<li><a href="#feb-2021">February 2021</a></li>
<li><a href="#mar-2021">March 2021</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbed1279" class="outline-2">
<h2 id="intro"><a id="orgbed1279"></a>Intro</h2>
<div class="outline-text-2" id="text-intro">
<p>
This worklog covers work performed on <a href="https://clojars.org">Clojars</a> under a contract from
the <a href="https://www.clojuriststogether.org/">Clojurists Together Foundation</a>. The contract covers security
improvements and general maintenance.
</p>
</div>
</div>

<div id="outline-container-org70139db" class="outline-2">
<h2 id="jan-2021"><a id="org70139db"></a>January 2021</h2>
<div class="outline-text-2" id="text-jan-2021">
<p>
<b>Changelogs:</b> <a href="https://github.com/clojars/clojars-server-config/compare/18c2ee360e93e25c804a9ef0fa458e07c3022b70...8b53cbf011f906dfb62a60ea75ff21468a3396fe"><code>clojars-server-config</code></a>
</p>

<p>
This work this month was general maintenance, along with debugging
issues with maven index creation.
</p>
</div>
</div>

<div id="outline-container-org5c14346" class="outline-2">
<h2 id="feb-2021"><a id="org5c14346"></a>February 2021</h2>
<div class="outline-text-2" id="text-feb-2021">
<p>
<b>Changelogs:</b> <a href="https://github.com/clojars/clojars-web/compare/de99524...956175e"><code>clojars-web</code></a>
</p>

<p>
The bulk of work this month was <a href="https://github.com/clojars/clojars-web/wiki/Verified-Group-Names">developing a plan</a> to improve security
by requiring groups to be verified and <a href="https://github.com/clojars/clojars-web/projects/1">starting work</a> on that plan.
</p>
</div>
</div>

<div id="outline-container-org40d3ea6" class="outline-2">
<h2 id="mar-2021"><a id="org40d3ea6"></a>March 2021</h2>
<div class="outline-text-2" id="text-mar-2021">
<p>
<b>Changelogs:</b> <a href="https://github.com/clojars/clojars-web/compare/956175...1885988ea69dd69193c13387ed413902760a2ca8"><code>clojars-web</code></a>, <a href="https://github.com/clojars/clojars-server-config/compare/8b53cbf011f906dfb62a60ea75ff21468a3396fe...0d6fe9b4594c291fdfc2e0413b730d43cbd2ccc3"><code>clojars-server-config</code></a>
</p>

<p>
The work this month moved us closer to <a href="https://github.com/clojars/clojars-web/projects/1">verified groups</a>, which included:
</p>
<ul class="org-ul">
<li><a href="https://github.com/clojars/clojars-web/issues/784">auto-verifying GitHub-based groups</a></li>
<li><a href="https://github.com/clojars/clojars-web/issues/786">login with GitLab</a></li>
<li><a href="https://github.com/clojars/clojars-web/issues/787">auto-verifying GitLab-based groups</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Crawley</p>
<p class="date">Created: 2021-04-10 Sat 11:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
